#include <algorithm>
#include <filesystem>
#include <iostream>

/*
Два гиганта Бо и Бер играют в игру. У каждого гиганта есть своя горная гряда. Вы
уже успели измерить все эти горы и теперь знаете, что высоты гор в гряде Бо
a1,a2,…an, а в гряде Бера b1,b2,…bm; горы нумеруются слева направо у Бо и справа
налево у Бера. В начале игры гиганты стоят на горе с номером 1. Таким образом,
они смотрят друг на друга и видят все свои горы и все горы соперника. Оказалось,
что Бо и Бер ценители прекрасного, поэтому горы в грядах располагаются в порядке
невозрастания, строго говоря, ai≥ai+1 для 1≤i<n и bi≥bi+1 для 1≤i<m.

На рисунке ниже изображен пример начального расположения, где Бо имеет гряду
a1,a2,a3=3,2,1, Бер имеет гряду b1,b2=4,2. Для простоты горы изображены
прямоугольниками, слева горы Бо, справа Бера. Для Вашего хорошего настроения
гиганты Бо и Бер обозначены бобрами.

Бо и Бер не очень умны, поэтому каждый ход они делают одно и то же действие. А
именно, гигант в свой ход берёт валун и кидает его в гору, на которой стоит его
соперник; от этого действия высота этой горы уменьшается на 1. Если гигант в
свой ход видит, что гора прямо перед ним выше (с номером на 1 больше), чем та,
на которой он стоит, то он перепрыгивает на неё. Если же гигант в свой ход
обнаруживает, что стоит на обычной земле (высота текущей горы 0) и перед ним нет
больше гор, то признаёт своё поражение. Первым ходит Бо.

Вы знаете, что их игра может длиться очень долго, ввиду огромных высот гор и их
количества, поэтому вы хотите посчитать, кто же победит. Входные данные

Каждый тест состоит из нескольких наборов входных данных. В первой строке
находится одно целое число t (1≤t≤500) — количество наборов входных данных.
Далее следует описание наборов входных данных.

Первая строка каждого набора входных данных содержит два целых числа n и m —
количество гор в гряде первого и второго гиганта соответственно (1≤n,m≤100).

Вторая строка набора входных данных содержит n целых чисел a1,a2,…an — высоты
гор первого гиганта (1≤ai≤109; ai≥ai+1).

Третья строка набора входных данных содержит m целых чисел b1,b2,…bm — высоты
гор второго гиганта (1≤bi≤109; bi≥bi+1). Выходные данные

Для каждого набора входных данных выведите единственное число — номер гиганта,
который победит. Пример Входные данные Скопировать

6
1 1
1
1
1 1
1
2
1 2
4
4 1
4 2
4 3 2 1
10 1
4 2
4 3 2 1
6 5
4 2
4 3 2 1
7 5

Выходные данные
Скопировать

1
2
2
2
1
2
*/

enum players { bo = 1, ber = 2 };

int main() {
  std::ios_base::sync_with_stdio(false);
  std::cin.tie(nullptr);

  int t = -1;
  std::cin >> t;
  for (auto i = 0; i < t; i++) {
    int n = -1, m = -1;
    std::cin >> n >> m;
    for (auto a = 0; a < n; a++) {
    }
    for (auto b = 0; b < m; b++) {
    }
  }
  return 0;
}