#include <algorithm>
#include <iostream>
#include <unordered_map>
#include <vector>

/*
A. Создание аббревиатур
ограничение по времени на тест
1 секунда
ограничение по памяти на тест
256 мегабайт

Бобру был дан набор слов S, в нём изначально содержалось n слов. Далее он m раз
выполнил следующую операцию:

    Бобр составляет последовательность из одного или более слов из множества S.
Одно и то же слово может встречаться в последовательности несколько раз. Из
получившейся фразы формируется аббревиатура∗. Затем бобр добавляет получившуюся
аббревиатуру в S и теперь может использовать её в последующих операциях как
обычное слово.

Вам даны n изначальных слов, которые были в множестве S, и множество
аббревиатур, которые составил Бобр. Определите, не ошибся ли Бобр и могли ли все
эти аббревиатуры появиться в результате применения вышеописанной операции.
Обратите внимание, что аббревиатуры появлялись не обязательно именно в таком
порядке, в каком они даются вам.

∗Аббревиатурой последовательности называется слово, составленное из первых букв
слов в последовательности. Например, birch OAK birch redwood формирует
аббревиатуру BOBR Входные данные

Каждый тест состоит из нескольких наборов входных данных. В первой строке
находится одно целое число t (1≤t≤500) — количество наборов входных данных.
Далее следует описание наборов входных данных.

Первая строка каждого набора входных данных содержит два целых числа n и m —
количество обычных слов и количество аббревиатур соответственно (1≤n,m≤100).

Каждая из следующих n строк содержит одну строку wi — обычное слово (1≤|wi|≤20).

Каждая из следующих m строк содержит одну строку ai — аббревиатуру, которую
составил Бобр (1≤|ai|≤20).

Все обычные слова состоят из строчных букв английского алфавита, а все
аббревиатуры — из заглавных букв английского алфавита. В каждом наборе входных
данных все строки w1,w2,…,wn,a1,a2,…,am попарно различны.

Суммарная длина всех строк по всем наборам входных данных не превосходит 50000.
Выходные данные

Для каждого набора входных данных выведите «YES», если существует подходящий
порядок появления данных аббревиатур, и «NO» иначе.

Вы можете выводить каждую букву в любом регистре (строчную или заглавную).
Например, строки «yEs», «yes», «Yes» и «YES» будут приняты как положительный
ответ.
4
6 4
apple
grand
banana
great
cherry
good
AG
BG
CG
ABC
1 1
apple
AA
1 2
apple
A
AA
2 2
apple
avocado
B
BA

Выходные данные
Скопировать

YES
YES
YES
NO
*/

int main() {
  std::ios_base::sync_with_stdio(false);
  std::cin.tie(nullptr);

  std::vector<std::string> result;

  int t = -1;
  std::cin >> t;

  for (auto i = 0; i < t; i++) {
    int n = -1, m = -1;
    std::cin >> n >> m;
    std::string text;
    std::unordered_map<char, int> map;
    for (auto a = 0; a < n; a++) {
      text.clear();
      std::cin >> text;
      if (map.contains(text[0])) {
        map[text[0]]++;
      } else {
        map.emplace(text[0], 1);
      }
    }
    int accepted = 0;
    for (auto b = 0; b < m; b++) {
      text.clear();
      std::cin >> text;
      int count = 0;
      std::transform(text.begin(), text.end(), text.begin(),
                     [](unsigned char c) { return std::tolower(c); });
      for (auto ch : text) {
        if (map.contains(ch)) {
          count++;
        }
      }
      if (count == text.length()) {
        accepted++;
      }
    }
    if (accepted == m) {
      result.emplace_back("YES");
    } else {
      result.emplace_back("NO");
    }
  }

  for (auto a : result) {
    std::cout << a << "\n";
  }

  return 0;
}